# Создайте переменную my_string и присвойте ей значение строки с произвольным текстом (функция input()).
my_string = "*****Здравствуйте, уважаемый преподаватель!*****"
print("Входная строка:", my_string)

# Вывести количество символов введённого текста
character_count = len(my_string)
print("Количество символов:", character_count)

# Выведите строку my_string в верхнем регистре.
print("Строка в верхнем регистре:",my_string .upper())

# Выведите строку my_string в нижнем регистре.
print("Строка в нижнем регистре:",my_string .lower())

# Измените строку my_string, удалив все пробелы.
print("Строка без пробелов:",my_string .replace(" ", ""))

# Выведите первый символ строки my_string.
print("Первый символ:",my_string[0])

# Выведите последний символ строки my_string.
print("Последний символ:",my_string[-1])
